app/Controllers/UserController.php

            $genderModel = new GenderModel();

            // Fetch all genders value from genders table in database
            $data['genders'] = $genderModel->findAll();
---
SELECT *
FROM `genders`